<?php
/*
 * Pterodactyl Panel 0.7.19  Bulgarian translation
 * Author: Kaloian Penchev (admin@kaloianpenchev.eu)
 * License: Free to use
 * Donate:
 *      PayPal: https://paypal.me/kalchobratme
 */

return [
    'notices' => [
        'created' => 'Нов пакет от гиг-ове, :name, беше успешно създаден.',
        'deleted' => 'Изтриването на пакет от гиг-ове беше успешно.',
        'updated' => 'Актуализацията на настройките на пакета от гиг-ове беше успешно.',
    ],
    'eggs' => [
        'notices' => [
            'imported' => 'Успешно импортнахте този гиг и свързаните с него променливи.',
            'updated_via_import' => 'Това яйце е актуализирано с помощта на предоставения файл.',
            'deleted' => 'Успешно изтрито заявеният гиг от панела.',
            'updated' => 'Конфигурацията на гиг-а е актуализирана успешно.',
            'script_updated' => 'Скриптът за инсталиране на гиг-ове е актуализиран и ще се изпълнява, когато се инсталират сървъри.',
            'egg_created' => 'Успешно създадохте нов гиг. Ще трябва да рестартирате всички работещи даемони, за да го приложите.',
        ],
    ],
    'variables' => [
        'notices' => [
            'variable_updated' => 'Променливата ":variable" беше актуализирана. Ще трябва да възстановите всички сървъри, използващи тази променлива, за да приложите промени.',
            'variable_deleted' => 'Променливата ":variable" е изтрита и вече няма да бъде достъпна за сървъри, след като бъде възстановен.',
            'variable_created' => 'Нова променлива е създадена успешно и е присвоена на това гиг.',
        ],
    ],
];
