<?php
/*
 * Pterodactyl Panel 0.7.19  Bulgarian translation
 * Author: Kaloian Penchev (admin@kaloianpenchev.eu)
 * License: Free to use
 * Donate:
 *      PayPal: https://paypal.me/kalchobratme
 */

return [
    'key' => [
        'warning' => 'Изглежда, че вече сте конфигурирали ключ за шифроване на приложение. Продължавайки с този процес с презаписване на този ключ и причиняване на повреда на данните за всички съществуващи криптирани данни. НЕ ПРОДЪЛЖАВАЙТЕ, АКО НЕ ЗНАЕТЕ КАКВО ПРАВИТЕ.',
        'confirm' => 'Разбирам последиците от изпълнението на тази команда и поемам цялата отговорност за загубата на криптирани данни.',
        'final_confirm' => 'Наистина ли искате да продължите? Промяната на ключа за шифроване на приложение ЩЕ ДОВЕДЕ ДО ЗАГУБА НА ДАННИ.',
    ],
    'location' => [
        'no_location_found' => 'Не беше намерен запис с предоставеният кратък код.',
        'ask_short' => 'Кратък код на локацията',
        'ask_long' => 'Описание на локацията',
        'created' => 'Успешно създадохте нова локация с име (:name) и ID :id.',
        'deleted' => 'Успешно изтрито избраната локазия.',
    ],
    'user' => [
        'search_users' => 'Въведете потребителско име, UUID, или Имейл адрес',
        'select_search_user' => 'ID на потребителя, който ще бъде изтрит (Напишете \'0\' за да търсите отново)',
        'deleted' => 'Потребителят е изтрит успешно от панела.',
        'confirm_delete' => 'Наистина ли искате да изтриете този потребител от панела?',
        'no_users_found' => 'Не са намерени потребители за предоставената дума за търсене.',
        'multiple_found' => 'Намерени са няколко акаунта за предоставения потребител, който не може да изтрие потребител поради --no-interaction флага.',
        'ask_admin' => 'Този потребител администратор ли ще бъде?',
        'ask_email' => 'Имейл адрес',
        'ask_username' => 'Потребителско име',
        'ask_name_first' => 'Име',
        'ask_name_last' => 'Фамилия',
        'ask_password' => 'Парола',
        'ask_password_tip' => 'Ако искате да създадете акаунт с произволна парола, изпратена по имейл на потребителя, изпълнете отново тази команда (CTRL + C) и предайте флага `--no-password`.',
        'ask_password_help' => 'Паролите трябва да са с дължина най-малко 8 знака и да съдържат поне една главна буква и цифра.',
        '2fa_help_text' => [
            'Тази команда ще деактивира 2-Факторната верификация за акаунт на потребител, ако е активиран. Това трябва да се използва като команда за възстановяване на акаунт само ако потребителят е блокиран от акаунта си.',
            'Ако това не е това, което сте искали да направите, натиснете CTRL + C, за да излезете от този процес.',
        ],
        '2fa_disabled' => '2-Факторната верификация беше премахната за :email.',
    ],
    'schedule' => [
        'output_line' => 'Изпращане на работа за първа задача в `:schedule` (:hash).',
    ],
    'maintenance' => [
        'deleting_service_backup' => 'Изтриване на бекъп файла за услугата :file.',
    ],
    'server' => [
        'rebuild_failed' => 'Заявката за възстановяване за ":name" (#:id) на Node ":node" не успя с грешка: :message',
        'power' => [
            'confirm' => 'На път сте да изпълните :action срещу :count сървъри. Искате ли да продължите?',
            'action_failed' => 'Заявка за действие за захранване за ":name" (#:id) на Node ":node" не успя с грешка: :message',
        ],
    ],
    'environment' => [
        'mail' => [
            'ask_smtp_host' => 'SMTP Хост (например smtp.gmail.com)',
            'ask_smtp_port' => 'SMTP Порт',
            'ask_smtp_username' => 'SMTP Потребител',
            'ask_smtp_password' => 'SMTP Парола',
            'ask_mailgun_domain' => 'Mailgun Домейн',
            'ask_mailgun_secret' => 'Mailgun Secret',
            'ask_mandrill_secret' => 'Mandrill Secret',
            'ask_postmark_username' => 'Postmark API Key',
            'ask_driver' => 'Кой драйвър трябва да се използва за изпращане на имейли?',
            'ask_mail_from' => 'Имейлите с имейл адреси трябва да произхождат от',
            'ask_mail_name' => 'Име, от което трябва да се изпращат имейлите',
            'ask_encryption' => 'Метод на криптиране, който да се използва',
        ],
        'database' => [
            'host_warning' => 'Силно се препоръчва да не използвате "localhost" като хост на вашата база данни, тъй като сме виждали чести проблеми с връзката на сокета. Ако искате да използвате локална връзка, която трябва да използвате "127.0.0.1".',
            'host' => 'Хост на Базата данни',
            'port' => 'Порт на Базата данни',
            'database' => 'Име на Базата данни',
            'username_warning' => 'Използвайки "root" акаунт за MySQL връзки е не само несигурно, но и не е разрешен от това приложение. Трябва да сте създали потребител на MySQL за този софтуер.',
            'username' => 'Потребител на Базата данни',
            'password_defined' => 'Изглежда, че вече имате дефинирана парола за връзка на MySQL, бихте ли искали да я промените?',
            'password' => 'Парола на Базата данни',
            'connection_error' => 'Не може да се свърже с MySQL сървъра с помощта на предоставените идентификационни данни. Върнатата грешка беше ":error".',
            'creds_not_saved' => 'Идентификационните ви данни за връзка НЕ ​​са запазени. Преди да продължите, ще трябва да предоставите валидна информация за връзката.',
            'try_again' => 'Върнете се и опитайте отново?',
        ],
        'app' => [
            'settings' => 'Активирайте визуалният редактор за настройки?',
            'author' => 'Имейл на автора на гиг-овете',
            'author_help' => 'Посочете имейл адреса, от който трябва да са гиг-овете, изнасяни от този панел. Това трябва да е валиден имейл адрес.',
            'app_url_help' => 'URL адресът на приложението ТРЯБВА да започне с https:// или http:// в зависимост от това дали използвате SSL или не. Ако не включите схемата, вашите имейли и друго съдържание ще се свържат с грешното местоположение.',
            'app_url' => 'URL Адрес на панела',
            'timezone_help' => 'Часовата зона трябва да съответства на един от поддържаните часови зони на PHP. Ако не сте сигурни, моля направете справка http://php.net/manual/en/timezones.php.',
            'timezone' => 'Времева зона на панела',
            'cache_driver' => 'Драйвър за кеша',
            'session_driver' => 'Драйвър за сесиите',
            'queue_driver' => 'Драйвър за опашките',
            'using_redis' => 'Избрахте драйвера Redis за една или повече опции, моля, предоставете валидна информация за връзка по-долу. В повечето случаи можете да използвате предоставените по подразбиране, освен ако не сте променили настройката си.',
            'redis_host' => 'Redis Хост',
            'redis_password' => 'Redis Парола',
            'redis_pass_help' => 'По подразбиране екземпляр на сървър Redis няма парола, тъй като се изпълнява локално и е недостъпен за външния свят. Ако случаят е такъв, просто натиснете Enter, без да въвеждате стойност.',
            'redis_port' => 'Redis Порт',
            'redis_pass_defined' => 'Изглежда парола вече е дефинирана за Redis, бихте ли искали да я промените?',
        ],
    ],
];
