<?php
/*
 * Pterodactyl Panel 0.7.19  Bulgarian translation
 * Author: Kaloian Penchev (admin@kaloianpenchev.eu)
 * License: Free to use
 * Donate:
 *      PayPal: https://paypal.me/kalchobratme
 */

return [
    'not_authorized' => 'Не сте упълномощени да извършвате това действие.',
    'auth_error' => 'При опита за влизане възникна грешка.',
    'authentication_required' => 'За продължаване се изисква удостоверяване.',
    'remember_me' => 'Запомни ме',
    'sign_in' => 'Вход',
    'forgot_password' => 'Забравих си паролата!',
    'request_reset_text' => 'Забравили сте паролата си? Не е краят на света, просто предоставете вашия имейл по-долу.',
    'reset_password_text' => 'Нулирайте паролата за акаунта си.',
    'reset_password' => 'Нулирайте паролата за акаунта',
    'email_sent' => 'Изпратен ви е имейл с допълнителни инструкции за нулиране на паролата ви.',
    'failed' => 'Предоставените идентификационни данни не съвпадат с тези, които имаме в записа, или предоставеният токен 2FA е невалиден.',
    'throttle' => 'Твърде много опити за влизане. Моля, опитайте отново след :seconds секунди.',
    'password_requirements' => 'Паролите трябва да съдържат най-малко един главен, малък и цифров знак и да са с дължина поне 8 знака.',
    'request_reset' => 'Намерете акаунт',
    '2fa_required' => '2-Факторна верификация',
    '2fa_failed' => '2FA токен-а е невалиден.',
    'totp_failed' => 'При опита за потвърждаване на TOTP възникна грешка.',
    '2fa_must_be_enabled' => 'Администраторът е заявил 2-Факторната верификация да бъде активна, за да може да използвате панела.',
];
