<?php
/*
 * Pterodactyl Panel 0.7.19  Bulgarian translation
 * Author: Kaloian Penchev (admin@kaloianpenchev.eu)
 * License: Free to use
 * Donate:
 *      PayPal: https://paypal.me/kalchobratme
 */

return [
    'daemon_connection_failed' => 'Имаше грешка при свързването с Daemon-а, който получи грешка с код HTTP/:code . Тази грешка е записана.',
    'node' => [
        'servers_attached' => 'Node-а не трябва да има свързани сървъри, за да бъде изтрит.',
        'daemon_off_config_updated' => 'Конфигурацията на Daemon-а <strong>беше успешно актуализирана</strong>, обаче възникна грешка при опита за автоматично актуализиране на конфигурационния файл на Daemon. Ще трябва да актуализирате ръчно конфигурационния файл (core.json) за да се приложат промените.',
    ],
    'allocations' => [
        'server_using' => 'Понастоящем към това разпределение е назначен сървър. Разпределението може да бъде изтрито само ако в момента няма зададен сървър.',
        'too_many_ports' => 'Добавянето на повече от 1000 порта в един диапазон наведнъж не се поддържа.',
        'invalid_mapping' => 'Предвиденото картографиране за порт :port е невалидно и не беше обработено.',
        'cidr_out_of_range' => 'CIDR нотация позволява само маски между /25 и /32.',
        'port_out_of_range' => 'Портовете в разпределението трябва да са по-големи от 1024 и по-малки или равни на 65535.',
    ],
    'nest' => [
        'delete_has_servers' => 'Гнездото с активни сървъри, прикрепени към него, не може да бъде изтрито от панела.',
        'egg' => [
            'delete_has_servers' => 'Яйце с активни сървъри, прикрепени към него, не може да бъде изтрито от панела.',
            'invalid_copy_id' => 'Яйцето, избрано за копиране на скрипт или не съществува, или копира самия скрипт.',
            'must_be_child' => 'Директивата "Копирай настройките от" за това яйце трябва да бъде дъщерна опция за избраното гнездо.',
            'has_children' => 'Това яйце е родител на едно или повече други яйца. Моля, изтрийте тези яйца, преди да изтриете това яйце.',
        ],
        'variables' => [
            'env_not_unique' => 'Env променливата :name трябва да е уникално за това Яйце.',
            'reserved_name' => 'Env променливата :name е защитена и не може да бъде присвоена на променлива.',
            'bad_validation_rule' => 'Правилото за валидация ":rule" не е валидно правило за това приложение.',
        ],
        'importer' => [
            'json_error' => 'Възникна грешка при опит за анализиране на JSON файла: :error.',
            'file_error' => 'JSON файлът, който бе предоставен е невалиден.',
            'invalid_json_provided' => 'JSON файлът, който бе предоставен, не е във формат, който може да бъде разпознат.',
        ],
    ],
    'packs' => [
        'delete_has_servers' => 'Не може да се изтрие пакет, който е прикрепен към активни сървъри.',
        'update_has_servers' => 'Не може да се промени свързаният ID на опция, когато сървърите в момента са прикачени към пакет.',
        'invalid_upload' => 'Предоставеният файл изглежда, че е невалиден.',
        'invalid_mime' => 'Предоставеният файл не отговаря на необходимия тип :type',
        'unreadable' => 'Предоставеният архив не може да бъде отворен от сървъра.',
        'zip_extraction' => 'Възникна грешка при опит за извличане на архива, предоставен на сървъра.',
        'invalid_archive_exception' => 'Изглежда, че в предоставения архив на пакети липсва задължителен archive.tar.gz или import.json файл в основната директория.',
    ],
    'subusers' => [
        'editing_self' => 'Редактирането на своят собствен подпотребител не е позволено.',
        'user_is_owner' => 'Не можете да добавите собственика на сървъра като подпотребител за този сървър.',
        'subuser_exists' => 'Потребител с този имейл вече е назначен като подпотребител за този сървър.',
    ],
    'databases' => [
        'delete_has_databases' => 'Не може да се изтрие хост сървър на база данни, който има активни бази данни, свързани с него.',
    ],
    'tasks' => [
        'chain_interval_too_long' => 'Максималното интервално време за верижна задача е 15 минути.',
    ],
    'locations' => [
        'has_nodes' => 'Не може да се изтрие местоположение, към което има прикрепени активни Node-ове.',
    ],
    'users' => [
        'node_revocation_failed' => 'Анулирането на ключове не бе успешно за <a href=":link">Node #:node</a>. :error',
    ],
    'deployment' => [
        'no_viable_nodes' => 'Не могат да бъдат намерени Node-ове, отговарящи на изискванията, посочени за автоматично внедряване.',
        'no_viable_allocations' => 'Не бяха намерени Node-ове, отговарящи на изискванията за автоматично разполагане.',
    ],
    'api' => [
        'resource_not_found' => 'Заявеният ресурс не съществува на този сървър.',
    ],
];
