<?php
/*
 * Pterodactyl Panel 0.7.19  Bulgarian translation
 * Author: Kaloian Penchev (admin@kaloianpenchev.eu)
 * License: Free to use
 * Donate:
 *      PayPal: https://paypal.me/kalchobratme
 */

return [
    'index' => [
        'title' => 'Разглеждате сървър :name',
        'header' => 'Сървърна конзола',
        'header_sub' => 'Управлявайте сървъра си в реално време.',
    ],
    'schedule' => [
        'header' => 'Диспечер на графици',
        'header_sub' => 'Управлявайте всички графици на сървъра на едно място.',
        'current' => 'Текущи графици',
        'new' => [
            'header' => 'Създайте нов график',
            'header_sub' => 'Създайте нов набор от планирани задачи за този сървър.',
            'submit' => 'Създайте задача',
        ],
        'manage' => [
            'header' => 'Управлявайте графика',
            'submit' => 'Актуализирайте графика',
            'delete' => 'Изтрийте графика',
        ],
        'task' => [
            'time' => 'След',
            'action' => 'Извършване на действие',
            'payload' => 'С разтоварване',
            'add_more' => 'Добавете друга задача',
        ],
        'actions' => [
            'command' => 'Изпращане на команда',
            'power' => 'Мощност действие',
        ],
        'toggle' => 'Превключване на състоянието',
        'run_now' => 'Изпълнение сега',
        'schedule_created' => 'Успешно създадохте нов график за този сървър.',
        'schedule_updated' => 'Графикът е актуализиран.',
        'unnamed' => 'График без име',
        'setup' => 'Настройка на графика',
        'day_of_week' => 'Ден от седмицата',
        'day_of_month' => 'Ден от месеца',
        'hour' => 'Час от деня',
        'minute' => 'Минута от часа',
        'time_help' => 'Системата за графици поддържа използването на синтаксис Cronjob при определяне кога задачите трябва да започнат да се изпълняват. Използвайте полетата по-горе, за да посочите кога тези задачи трябва да започнат да се изпълняват или изберете опции от множеството менюта за избор.',
        'task_help' => 'Времената за задачите са спрямо предварително дефинираната задача. Всеки график може да има не повече от 5 задачи, които да му бъдат възложени, а задачите не могат да бъдат насрочени на разстояние повече от 15 минути.',
    ],
    'tasks' => [
        'task_created' => 'Успешно създадохте нова задача на панела.',
        'task_updated' => 'Задачата е успешно актуализирана. Всички действия, които в момента са на опашка, ще бъдат отменени и ще се изпълнят отново в следващия определен час.',
        'header' => 'Планирани задачи',
        'header_sub' => 'Автоматизирайте сървъра си.',
        'current' => 'Текущи планирани задачи',
        'actions' => [
            'command' => 'Изпълнете команда',
            'power' => 'Изпълнете опция за захранване',
        ],
        'new_task' => 'Добавете нова задача',
        'toggle' => 'Превключване на състоянието',
        'new' => [
            'header' => 'Нова задача',
            'header_sub' => 'Създайте нова планирана задача за този сървър.',
            'task_name' => 'Име на задачата',
            'day_of_week' => 'Ден от седмицата',
            'custom' => 'Персонализирана стойност',
            'day_of_month' => 'Ден от месеца',
            'hour' => 'Час',
            'minute' => 'Минута',
            'sun' => 'Неделя',
            'mon' => 'Понеделник',
            'tues' => 'Вторник',
            'wed' => 'Сряда',
            'thurs' => 'Четвъртък',
            'fri' => 'Петък',
            'sat' => 'Събота',
            'submit' => 'Създаване на задачата',
            'type' => 'Тип на задачата',
            'chain_then' => 'После',
            'chain_do' => 'Направи',
            'chain_arguments' => 'с аргументи',
            'payload' => 'Разтоварване на задачата',
            'payload_help' => 'For example, if you selected <code>Send Command</code> enter the command here. If you selected <code>Send Power Option</code> put the power action here (e.g. <code>restart</code>).',
        ],
        'edit' => [
            'header' => 'Управление на задачата',
            'submit' => 'Актуализиране на задачата',
        ],
    ],
    'users' => [
        'header' => 'Управление на потребителите',
        'header_sub' => 'Контролирайте кой има достъп до сървърите Ви.',
        'configure' => 'Настройте правата',
        'list' => 'Акаунти с достъп',
        'add' => 'Добави нов подпотребител',
        'update' => 'Актуализирай подпотребител',
        'user_assigned' => 'Успешно назначен нов подпотребител на този сървър.',
        'user_updated' => 'Успешно актуализирахте правата.',
        'edit' => [
            'header' => 'Редактирайте подпотребителя',
            'header_sub' => 'Управлявайте достъпа на подпотребителите към сървър.',
        ],
        'new' => [
            'header' => 'Добавете нов потребител',
            'header_sub' => 'Добавете нов потребител с достъп до този сървър.',
            'email' => 'Имейл',
            'email_help' => 'Напишете имейла на потребителя, който искате да управлява този сървър.',
            'power_header' => 'Управление на мощността',
            'file_header' => 'Файлов Мениджър',
            'subuser_header' => 'Управление на подпотребителите',
            'server_header' => 'Управление на сървъра',
            'task_header' => 'Управление на графиците',
            'database_header' => 'Управление на базите денни',
            'power_start' => [
                'title' => 'Стартира сървъра',
                'description' => 'Позволява на потребителя да стартира сървъра.',
            ],
            'power_stop' => [
                'title' => 'Спира сървъра',
                'description' => 'Позволява на потребителя да спира сървъра.',
            ],
            'power_restart' => [
                'title' => 'Рестартира сървъра',
                'description' => 'Позволява на потребителя да рестартира сървъра',
            ],
            'power_kill' => [
                'title' => 'Убива сървъраа',
                'description' => 'Позволява на потребителя да убива сървъра.',
            ],
            'send_command' => [
                'title' => 'Изпраща команди в конзолата',
                'description' => 'Позволява изпращането на команди в конзолата. Ако потребителя няма правата за стартиране/спиране, те не могат да изпращат и тези команди.',
            ],
            'access_sftp' => [
                'title' => 'SFTP достъп',
                'description' => 'Позволява на потребителя да се свързва с SFTP към сървъра.',
            ],
            'list_files' => [
                'title' => 'Достъп до файловете',
                'description' => 'Позволява на потребителя да вижда папките и файловете на сървъра, но не и съдържанието им.',
            ],
            'edit_files' => [
                'title' => 'Редактира файлове',
                'description' => 'Позволява на потребителя да вижда съдържанието на файлове, без да го променя (не е засегнато от SFTP).',
            ],
            'save_files' => [
                'title' => 'Запазва файлове',
                'description' => 'Позволява на потребителя да запазва променено съдържание на файловете (не е засегнато от SFTP)',
            ],
            'move_files' => [
                'title' => 'Преименува и превества файлове',
                'description' => 'Позволява на потребителя да преименува и мести файлове в системата.',
            ],
            'copy_files' => [
                'title' => 'Копира файлове',
                'description' => 'Позволява на потребителя да копира файлове в системата.',
            ],
            'compress_files' => [
                'title' => 'Компресира файлове',
                'description' => 'Позволява на потребителя да прави архиви на папки и файлове в системата.',
            ],
            'decompress_files' => [
                'title' => 'Декомпресира файлове',
                'description' => 'Позволява на потребителя да разархивира .zip и .tar(.gz) файлове в системата.',
            ],
            'create_files' => [
                'title' => 'Създава файлове',
                'description' => 'Позволява на потребителя да създава файлове в системата.',
            ],
            'upload_files' => [
                'title' => 'Качва файлове',
                'description' => 'Позволява на потребителя да качва файлове през файловият мениджъра.',
            ],
            'delete_files' => [
                'title' => 'Изтрива файлове',
                'description' => 'Позволява на потребителя да трие файлове в системата.',
            ],
            'download_files' => [
                'title' => 'Тегли файлове',
                'description' => 'Позволява на потребителя да тегли файлове от файловият мениджър. Тогава той ще има право да вижда съдържанието на файлове, дори да е забранено от панела',
            ],
            'list_subusers' => [
                'title' => 'Вижда другите подпотребители',
                'description' => 'Позволява на потребителя да вижда всички подпотребители, свързани с конкретния сървър.',
            ],
            'view_subuser' => [
                'title' => 'Вижда правата на подпотребителите',
                'description' => 'Позволява на потребителя да вижда правата на други подпотребители, свързани с конкретния сървър.',
            ],
            'edit_subuser' => [
                'title' => 'Редактира подпотребителите',
                'description' => 'Позволява на потребителя да прави промени по правата на други подпотребители.',
            ],
            'create_subuser' => [
                'title' => 'Създава подпотребители',
                'description' => 'Позволява на потребителя да създава други подпотребители.',
            ],
            'delete_subuser' => [
                'title' => 'Трие подпотребители',
                'description' => 'Позволява на потребителя да трие други подпотребители.',
            ],
            'view_allocations' => [
                'title' => 'Вижда разпределенията',
                'description' => 'Позволява на потребителя да вижда IP адресите и портовете, свързани с конкретния сървър.',
            ],
            'edit_allocation' => [
                'title' => 'Променя връзката по подразбиране',
                'description' => 'Позволява на потребителя да променя връзката по подразбиране на сървъра.',
            ],
            'view_startup' => [
                'title' => 'Вижда стартиращата команда',
                'description' => 'Позволява на потребителя да вижда командата, която се изпълнява при стартиране на сървъра.',
            ],
            'edit_startup' => [
                'title' => 'Променя стартиращата команда',
                'description' => 'Позволява на потребителя да променя командата, която се изпълнява при стартиране на сървъра.',
            ],
            'list_schedules' => [
                'title' => 'Списък с графици',
                'description' => 'Позволява на потребителя да листва графиците (включва и изключва) за този сървър.',
            ],
            'view_schedule' => [
                'title' => 'Преглежда графика',
                'description' => 'Позволява на потребителя да променя графика и всичките му полета',
            ],
            'toggle_schedule' => [
                'title' => 'Превключва графика',
                'description' => 'Позволява на потребителя да сменя статуса на грефика между активен и неактивен.',
            ],
            'queue_schedule' => [
                'title' => 'Опашка на графиците',
                'description' => 'Позволява на потребителя да слага графици на опашката и да пуска команди на следващия му процесен цикъл.',
            ],
            'edit_schedule' => [
                'title' => 'Редактира грефик',
                'description' => 'Позволява на потребителя да редактира графиците.',
            ],
            'create_schedule' => [
                'title' => 'Създава график',
                'description' => 'Позволява на потребителя да създава графици.',
            ],
            'delete_schedule' => [
                'title' => 'Трие графици',
                'description' => 'Позволява на потребителя да трие графици.',
            ],
            'view_databases' => [
                'title' => 'Вижда базите данни',
                'description' => 'Позволява на потребителя да вижда базите данни, свързани с конкретния сървър.',
            ],
            'reset_db_password' => [
                'title' => 'Нулира паролата за базита данни',
                'description' => 'Позволява на потребителя да нулира паролата за базита данни.',
            ],
            'delete_database' => [
                'title' => 'Трие базите данни',
                'description' => 'Позволява на потребителя да трие базите данни.',
            ],
            'create_database' => [
                'title' => 'Създава бази данни',
                'description' => 'Позволява на потребителя да създава бази данни.',
            ],
        ],
    ],
    'allocations' => [
        'mass_actions' => 'Масови действия',
        'delete' => 'Трие разпределения',
    ],
    'files' => [
        'exceptions' => [
            'invalid_mime' => 'Този тип файл не може да се редактира от едитора на панела.',
            'max_size' => 'Този тип файл е прекалено голям, за да се редактира от едитора на панела.',
        ],
        'header' => 'Файлов мениджър',
        'header_sub' => 'Управлявайте всичките си файлове директно от мрежата.',
        'loading' => 'Зареждането на първоначалната файлова структура може да отнеме няколко секунди.',
        'path' => 'Когато конфигурирате каквито и да е файлови пътища в плъгините или настройките на вашия сървър, трябва да използвате :path като основен път. Максималният размер за качване на уеб базирани файлове в този Node е :size.',
        'seconds_ago' => 'секунди',
        'file_name' => 'Име на файла',
        'size' => 'Размер',
        'last_modified' => 'Последно модифициран',
        'add_new' => 'Добави нов файл',
        'add_folder' => 'Добави нова папка',
        'mass_actions' => 'Масови действия',
        'delete' => 'Изтрийте файлове',
        'edit' => [
            'header' => 'Редактирайте файл',
            'header_sub' => 'Правете модификации на файл от мрежата.',
            'save' => 'Запазване на файла',
            'return' => 'Връщане във файловият мениджър',
        ],
        'add' => [
            'header' => 'Нов файл',
            'header_sub' => 'Създаване на нов файл в сървъра.',
            'name' => 'Име на файла',
            'create' => 'Създаване на файл',
        ],
    ],
    'config' => [
        'name' => [
            'header' => 'Име на сървъра',
            'header_sub' => 'Смяна на името на сървъра.',
            'details' => 'Името на сървъра е само препратка към този сървър на панела и няма да засегне конкретни конфигурации на сървъра, които могат да се показват на потребителите в игрите.',
        ],
        'startup' => [
            'header' => 'Конфигуриране на старт-а',
            'header_sub' => 'Контролирайте стартовите параметрите на сървъра.',
            'command' => 'Стартова команда',
            'edit_params' => 'Промяна на параметрите',
            'update' => 'Актуализирайте стартовите параметри',
            'startup_regex' => 'Правила за подредба',
            'edited' => 'Стартовите променливи бяха успешно актуализирани. Те ще се в действие следващият път, когато сървърът се стартира.',
        ],
        'sftp' => [
            'header' => 'SFTP Конфигурация',
            'header_sub' => 'Данни за SFTP акаунта.',
            'details' => 'SFTP Данни',
            'conn_addr' => 'Адрес за връзка',
            'warning' => 'Паролата за SFTP е паролата за акаунта Ви в панела. Нагласете клиента Ви да използва SFTP, а не FTP или FTPS за връзка. Има разлика в протоколите.',
        ],
        'database' => [
            'header' => 'Бази данни',
            'header_sub' => 'Всички бази данни налични за този сървър.',
            'your_dbs' => 'Конфигурирани бази данни',
            'host' => 'MySQL Хост',
            'reset_password' => 'Нулиране на паролата',
            'no_dbs' => 'Няма бази данни, свързани с този сървър.',
            'add_db' => 'Добавете нова база данни.',
        ],
        'allocation' => [
            'header' => 'Сървърни разпределения',
            'header_sub' => 'Контролирайте IP адресите и портовете, налични на този сървър.',
            'available' => 'Налични разпределения',
            'help' => 'Помощ за разпределенията',
            'help_text' => 'Списъкът отляво включва всички налични IP адреси и портове, които са отворени за сървъра ви за входящи връзки.',
        ],
    ],
];
